In [1]:
# Importando pacotes
import pandas as pd

In [5]:
# Criando Data Frame
data1 = {'TICKET':[34.5,32.3,35.6,37.0,31.2]}
data2 = pd.DataFrame(data1)
data2

   TICKET
0    34.5
1    32.3
2    35.6
3    37.0
4    31.2

In [8]:
# Verificando o tipo de variável no Data Frame
data2.dtypes

TICKET    float64
dtype: object

In [9]:
# Criando uma nova variável no formato string (texto)
data2['TICKET2'] = data2['TICKET'].astype(str)
data2

   TICKET TICKET2
0    34.5    34.5
1    32.3    32.3
2    35.6    35.6
3    37.0    37.0
4    31.2    31.2

In [10]:
# Verificando o tipo das variáveis no Data Frame
data2.dtypes

TICKET     float64
TICKET2     object
dtype: object